pinkymaxou/powered-soapbox-car/test/esp32s3-lcd43/sdkconfig.defaults
# Cible ESP32-S3, flash 16 Mo, PSRAM Octal (framebuffer RGB), 240 MHz.
CONFIG_IDF_TARGET="esp32s3"

CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# PSRAM Octal — indispensable pour le framebuffer 800×480×2 (~750 Ko)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000

# LVGL : couleur 16 bits (RGB565)
CONFIG_LV_COLOR_DEPTH_16=y
